In [64]:
# import modules
import pandas as pd

In [65]:
# Scrape data and check for number of records per year
years = (2015, 2016, 2017, 2018, 2019)

all_COLI_data = []

for year in years:
    url = 'https://www.numbeo.com/cost-of-living/rankings_by_country.jsp?title=' + str(year)
    print(url)
    COLI_data = pd.read_html(url)
    print(len(COLI_data[2]))
    all_COLI_data.append(COLI_data[2])

https://www.numbeo.com/cost-of-living/rankings_by_country.jsp?title=2015
119
https://www.numbeo.com/cost-of-living/rankings_by_country.jsp?title=2016
122
https://www.numbeo.com/cost-of-living/rankings_by_country.jsp?title=2017
121
https://www.numbeo.com/cost-of-living/rankings_by_country.jsp?title=2018
115
https://www.numbeo.com/cost-of-living/rankings_by_country.jsp?title=2019
119

In [66]:
df_2015 = pd.DataFrame(all_COLI_data[0])
df_2016 = pd.DataFrame(all_COLI_data[1])
df_2017 = pd.DataFrame(all_COLI_data[2])
df_2018 = pd.DataFrame(all_COLI_data[3])
df_2019 = pd.DataFrame(all_COLI_data[4])
ranking_df = pd.concat([df_2015, df_2016, df_2017,df_2018,df_2019 ])
#ranking_df.to_csv("/Users/eamonnmccallum/Monash-DS/groupwork/STDs/work/data/numbeo_ranking_raw.csv")
ranking_df

,Rank,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
0,NaN,Switzerland,126.03,57.63,92.61,128.44,127.64,146.51
1,NaN,Norway,118.59,48.70,84.43,110.06,141.45,96.30
2,NaN,Venezuela,111.01,34.13,73.44,128.43,91.09,11.90
3,NaN,Iceland,102.14,35.86,69.75,103.76,105.21,70.84
4,NaN,Denmark,100.60,34.71,68.40,88.59,117.53,105.70
...,...,...,...,...,...,...,...,...
114,NaN,Kosovo (Disputed Territory),26.18,8.05,17.48,23.21,19.57,61.82
115,NaN,Venezuela,25.73,5.89,16.20,27.58,21.98,3.71
116,NaN,India,24.17,5.84,15.37,24.20,17.15,66.91
117,NaN,Tunisia,23.69,4.96,14.69,22.27,13.33,37.99
118,NaN,Pakistan,20.40,4.50,12.76,18.25,15.42,38.61

In [67]:
continent  = pd.read_csv("/Users/eamonnmccallum/Monash-DS/groupwork/STDs/work/data/country-and-continent-codes-list-csv_csv.csv")
continent

,Continent_Name,Continent_Code,Country_Name,Two_Letter_Country_Code,Three_Letter_Country_Code,Country_Number
0,Asia,AS,"Afghanistan, Islamic Republic of",AF,AFG,4.0
1,Europe,EU,"Albania, Republic of",AL,ALB,8.0
2,Antarctica,AN,Antarctica (the territory South of 60 deg S),AQ,ATA,10.0
3,Africa,AF,"Algeria, People's Democratic Republic of",DZ,DZA,12.0
4,Oceania,OC,American Samoa,AS,ASM,16.0
...,...,...,...,...,...,...
257,Africa,AF,"Zambia, Republic of",ZM,ZMB,894.0
258,Oceania,OC,Disputed Territory,XX,NaN,NaN
259,Asia,AS,Iraq-Saudi Arabia Neutral Zone,XE,NaN,NaN
260,Asia,AS,United Nations Neutral Zone,XD,NaN,NaN
261,Asia,AS,Spratly Islands,XS,NaN,NaN

In [75]:
split = continent["Country_Name"].str.split(",",expand=True)
new_df = pd.merge(continent , split, left_index=True, right_index=True,how="left")

In [79]:
new_df = new_df[["Continent_Name", 0]]

In [82]:
new_df = new_df.rename( columns = {0 : "Country"})

In [83]:
new_df.to_

    Continent_Name                                       Country
0             Asia                                   Afghanistan
1           Europe                                       Albania
2       Antarctica  Antarctica (the territory South of 60 deg S)
3           Africa                                       Algeria
4          Oceania                                American Samoa
..             ...                                           ...
257         Africa                                        Zambia
258        Oceania                            Disputed Territory
259           Asia                Iraq-Saudi Arabia Neutral Zone
260           Asia                   United Nations Neutral Zone
261           Asia                               Spratly Islands

[262 rows x 2 columns]